app/controllers/accounts_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
SELECT `gamers`.* FROM `gamers` WHERE (`gamers`.user_id = 1)
---
  def index
    @accounts = User.find(:all, :include => :gamer)