app/controllers/games_controller.rb

SELECT * FROM `games` WHERE (`games`.round_id = 1)
SELECT * FROM `groups`
SELECT * FROM `teams` LIMIT 1
SELECT * FROM `rounds`
---
  def index
    @groups = Group.all(:include => [:games, :teams])
    @rounds = Round.all(:include => [:games, :teams])