app/controllers/gamers_controller.rb

SELECT * FROM `gamers` WHERE (`gamers`.`id` = 3)
---
  def show
    @gamer = Gamer.find(params[:id])

INSERT INTO `gamers` (`user_id`, `firstname`, `lastname`, `street1`, `street2`, `zipcode`, `city`, `country`, `phone`, `twitter`, `created_at`, `updated_at`) VALUES(1, '', '', '', '', '', '', 'Deutschland', NULL, NULL, '2009-10-02 15:37:38', '2009-10-02 15:37:38')
UPDATE `gamers` SET `user_id` = NULL, `updated_at` = '2009-10-02 15:37:50' WHERE `id` = 1
---
  def create
    @gamer = current_user.build_gamer(params[:gamer])

    if @gamer.save

UPDATE `gamers` SET `zipcode` = '48524', `updated_at` = '2009-10-02 17:13:34' WHERE `id` = 6
---
  def update
    @gamer = current_user.gamer

    respond_to do |format|
      if @gamer.update_attributes(params[:gamer])