app/controllers/games_controller.rb

SELECT * FROM `teams` WHERE (`teams`.`id` = 1)
---
  def index
    @groups = Group.find(:all, :include => [:games, :teams])