app/controllers/groups_controller.rb

  def index
    @groups = Group.find(:all, :include => :teams)
---
SELECT * FROM `teams` WHERE (`teams`.group_id = 1)