app/controllers/tipps_controller.rb

SELECT * FROM `gamers` WHERE (`gamers`.user_id = 1) LIMIT 1
---
  def index
    if params[:gamer_id]
      @gamer = Gamer.find(params[:gamer_id])