app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`email`, `crypted_password`, `persistence_token`, `created_at`, `updated_at`, `status`, `perishable_token`) VALUES('mjohann@rails-experts.com', 'a7944c46edb15a444ee1facd57fb23cf7d675bf3634e0bd5728d9866bbd8f5154829981e0af0c5b50e2f5534484d8a398363fcd185c3737844e424dd81196907', '6b3d45bc0c1380fbdd837a60d508d2b4d0ff996d6880cf5a9bfb56944e015c49994d0c1f0968ffb923e1c9f7d3454feafe221ab3ac8f5d8e87590a35b491886b', '2009-09-29 12:11:16', '2009-09-29 12:11:16', 'pending', 'QJ7tQY1BNkeaaombPdz2')